# # Home work 1.1
#
# print("Привет, мир!")
#
# print(1-1+5)
#
# print('--------------------------------------------')
#
# print("Это по прежнему строка 123456")
#
# print("1\n2\n3\n4")
#
# print(1,2,3,4,5)
#
# help(print)
#
# print(1,2,3,4, 8, sep='```')
#
# print(1, 2, 3, sep='@@@', end= '\n+++\n')
#
# # Home work 1.1
#
# # hello+world+python=!
#
# print("hello", "world", "python", sep='+', end='=!')
# print('------------------------------------------')
# # Home work 1.2.1
# #      *
# #     * *
# #    *    *
# #   *      *
# #  *         *
# # *************
#
# print("       *", "      * *", "     *   *", "    *     *", "   *       *", "  *         *", " *************", sep='\n')

# # Home work 1.2.2
# # +-----------+
# # |           |
# # |           |
# # |           |
# # |           |
# # |           |
# # +-----------+
print("+", 10 * "-", sep='', end='+\n')

print("|", 10 * " ", sep='', end="|\n")

print("|", 10 * " ", sep='', end="|\n")

print("|", 10 * " ", sep='', end="|\n")

print("|", 10 * " ", sep='', end="|\n")

print("+", 10 * "-", sep='', end='+\n')


# # Home work 1.3
#
#
# print("Привет, друг!\nЭто программа\nВыбери 1\nВыбери2")
#
# print()
# # Это длинная строка с переносами.
# print("""
# Привет, друг!
# Это программа
# Выбери 1
# Выбери 2
# Выбери еще что нибудь
# """)
#
#
# # Numbers
# print(2.4, -4.6666)
# print()
#
# print(.1234)
# print()
#
# print(123.)
# print()
#
# print(5E6)
# print()
#
# print(3E2 - 12)
#
# # String
# print()
#
# print("Привет, друг!\nЭто программа\nВыбери 1\nВыбери2")
#
# print("-------------------------------------------------------")
#
# print("""
#       Привет, друг!
#       Это программа
#       Выбери 1
#       Выбери 2
#       Выбери еще что нибудь
#       """)
#
# print("-------------------------------------------------------")
#
# # Bool
# print(True, False, "True 1123 False")
#
# print("-------------------------------------------------------")
#
# # Variebles
#
# number_1 = 1
#
# number_2 = 444
#
# number_3 = 33
#
# result_sum = number_1 + number_2 + number_3
#
# print(number_1, number_2, number_3, result_sum)
#
# print((result_sum + result_sum)*5)
#
# phone = '+375297788999'
#
# print(phone)
# print("-------------------------------------------------------")
#
#
# # math operations
# # +
# # -
# # *
# # /
# # // целочисленное деление
# # % остаток от деления
# # ** возведение в степень
#
# # a2 + b2*2
#
# res = 55**2 + 33**2 * 2
#
# print(res)
#
# x = 5
# print(x)
#
# x += 1
#
# print(x)
#
# print("-------------------------------------------------------")
#
# sum_2 = 150.566123265686666666666666666666666666666666666666666
#
# print(round(sum_2, 2))