# Home work 2.5
# Необходимо найти наибольшее из четырех целых чисел

# Ввод чисел с клавиатуры.

num_1 = int(input('Введите первое целое число: '))
num_2 = int(input('Введите второе целое число: '))
num_3 = int(input('Введите третье целое число: '))
num_4 = int(input('Введите четвертое целое число: '))

# Сравнение чисел друг с другом

# if num_1 >= num_2 and num_1 > num_3 and num_1 > num_4:  # Проверяем первое число через сравнение с каждым
#     print(f'Наибольшее число: {num_1}')
# elif num_2 > num_1 and num_2 > num_3 and num_2 > num_4:
#     print(f'Наибольшее число: {num_2}')
# elif num_3 > num_1 and num_3 > num_2 and num_3 > num_4:
#     print(f'Наибольшее число: {num_3}')
# else:
#     print(f'Наибольшее число: {num_4}')


